УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм</name>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелефонНеЗарегестрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Настройки/КонтурЛогистика_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Настройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      <types>EnumRef.КонтурЛогистика_ТипыПрокси</types>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.КонтурЛогистика_ЕдиницыИзмеренияГСМ</types>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
      <types>EnumRef.КонтурЛогистика_ТипыТранспортныхСредств</types>
      <types>EnumRef.КонтурЛогистика_ФункцииЗаказаЗаявки</types>
      <types>CatalogRef.Валюты</types>
      <types>EnumRef.КонтурЛогистика_МастерДанныеСотрудников</types>
      <types>CatalogRef.Контрагенты</types>
      <types>EnumRef.КонтурЛогистика_СпособыПередачиМЧД</types>
      <types>Boolean</types>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      <types>EnumRef.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</types>
      <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
      <types>CatalogRef.Организации</types>
      <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
      <types>EnumRef.КонтурЛогистика_ТипыПМ</types>
      <types>String</types>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>EnumRef.КонтурЛогистика_РежимыАвторизации</types>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.КонтурЛогистика_СпособыСопоставленияТоваровТитул3</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.Партнеры</types>
      <types>EnumRef.КонтурЛогистика_СценарииПодписанияТитулов</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>EnumRef.КонтурЛогистика_ВариантыВалидации</types>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
      <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
      <types>EnumRef.КонтурЛогистика_ТипыСопроводительныхДокументов</types>
      <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
      <types>CatalogRef.ЗоныДоставки</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях до 8.3.20 запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗначений</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
        <types>EnumRef.КонтурЛогистика_ТипыЛиц</types>
        <types>EnumRef.КонтурЛогистика_УровниДоступаСотрудника</types>
        <types>CatalogRef.Валюты</types>
        <types>CatalogRef.Контрагенты</types>
        <types>Boolean</types>
        <types>EnumRef.КонтурЛогистика_ГруппыУпаковки</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>CatalogRef.Организации</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>String</types>
        <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
        <types>CatalogRef.Пользователи</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.ТранспортныеСредства</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>EnumRef.КонтурЛогистика_КлассыОпасностиГрузов</types>
        <types>CatalogRef.Склады</types>
        <types>EnumRef.КонтурЛогистика_ИнициаторыПереадресовки</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
        <types>CatalogRef.ЗоныДоставки</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_УведомленияПродукта/КонтурЛогистика_УведомленияПродукта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_УведомленияПродукта</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИменаФорм</name>
    <attributes>
      <name>ИмяФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.РасширениеКонтурЛогистика/src/CommonModules/КонтурЛогистика_ОбновлениеСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПолучитьСведенияОбОбновлении(НомерВерсии, АдресРезультата, ИмяРасширения = "") Экспорт
	
	СтруктураОбновленияВерсии = ПодготовитьСтруктуруОбновленияВерсии();
	
	ИмяПродукта = ИмяПродукта(ИмяРасширения);
	Ответ = СерверОбновлений_ПроверитьНовуюВерсию(НомерВерсии, ИмяПродукта);
	
	Если Ответ.Успешно Тогда
		
		УдалосьРаспарситьОтвет = Ложь;
		
		Попытка
			ДанныеОбновления = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
			УдалосьРаспарситьОтвет = Истина;
		Исключение
			СтруктураОбновленияВерсии.Ошибка = ОписаниеОшибки();
		КонецПопытки;
		
		Если Не УдалосьРаспарситьОтвет Тогда
			ПоместитьВоВременноеХранилище(СтруктураОбновленияВерсии, АдресРезультата);
		КонецЕсли;
		
		СтруктураОбновленияВерсии.Успешно = Истина;
		СтруктураОбновленияВерсии.НомерВерсии = ДанныеОбновления.name;
		СтруктураОбновленияВерсии.ЕстьОбновление = ДанныеОбновления.contain_update;
		
		Если СтруктураОбновленияВерсии.ЕстьОбновление Тогда
			
			СтруктураОбновленияВерсии.ДатаВыхода = ДанныеОбновления.release_date;
			
			Если ЗначениеЗаполнено(ДанныеОбновления.description) Тогда
				Попытка
					ОписаниеСтруктура = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(ДанныеОбновления.description);
				Исключение
					ОписаниеСтруктура = Неопределено;
				КонецПопытки;
				
				Если ТипЗнч(ОписаниеСтруктура) = Тип("Структура") Тогда
					СтруктураОбновленияВерсии.СсылкаНаОписание = ОписаниеСтруктура.link;
					СтруктураОбновленияВерсии.КраткоеОписание = СтрЗаменить(ОписаниеСтруктура.description, "\n", Символы.ПС);
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого СсылкаНаКонтент Из ДанныеОбновления.links Цикл
				
				Если СсылкаНаКонтент.content_type = "zip"
					Или (ЗначениеЗаполнено(ИмяРасширения)
						И СсылкаНаКонтент.content_type = "extension") Тогда
					
					СтруктураОбновленияВерсии.СсылкаНаЗагрузку = СсылкаНаКонтент.href;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		СтруктураОбновленияВерсии.Ошибка = Ответ.Ошибка;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СтруктураОбновленияВерсии, АдресРезультата);
	
КонецПроцедуры

Функция ПолучитьСведенияОбПараметрахПодключенияSentry() Экспорт
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияSentry.НовыйПараметрыСервиса();
	
	ИмяПродукта = БазовоеИмяПродукта();
	
	ОтправлятьМетрикиВТест = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ОтправлятьМетрикиВТест");
	ИспользоватьТестовыйСерверДиадок = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	Если ИспользоватьТестовыйСерверДиадок Или ОтправлятьМетрикиВТест Тогда
		АдресСервера = АдресТестовогоСервераОбновлений();
	Иначе
		АдресСервера = АдресПродуктивногоСервераОбновлений();
	КонецЕсли;
	
	АдресМетода = АдресСервера + "/1c/v2/" + ИмяПродукта + "/check/1";
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	Ответ = ВыполнитьHTTPЗапрос_СерверОбновлений(АдресМетода, ПараметрыЗапроса, Истина);
	
	Если Ответ.Успешно Тогда
		
		Попытка
			
			ДанныеОбновления = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
			
			ОписаниеСтруктура = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(ДанныеОбновления.description);
			
			Если ТипЗнч(ОписаниеСтруктура) = Тип("Структура") И ОписаниеСтруктура.Свойство("sentry") Тогда
				ЗаполнитьЗначенияСвойств(ПараметрыСервиса, ОписаниеСтруктура.sentry);
			КонецЕсли;
			
		Исключение
			ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
			ТекстОшибки = "Ошибка при получении данных из сервиса обновления.
				|Текст ошибки: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ПараметрыСервиса;
	
КонецФункции

Процедура ПолучитьИсториюВерсий(КоличествоВерсий, АдресРезультата) Экспорт
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Успешно", Ложь);
	СтруктураРезультата.Вставить("Ошибка", "");
	СтруктураРезультата.Вставить("ТаблицаИсторииВерсий", Неопределено);
	
	ИмяПродукта = ИмяПродукта();
	Ответ = СерверОбновлений_ПолучитьИсториюВерсий(ИмяПродукта, КоличествоВерсий);
	
	Если Ответ.Успешно Тогда
		
		УдалосьРаспарситьОтвет = Ложь;
		
		Попытка
			СписокВерсийСтруктура = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
			УдалосьРаспарситьОтвет = Истина;
		Исключение
			СтруктураРезультата.Ошибка = ОписаниеОшибки();
		КонецПопытки;

		Если Не УдалосьРаспарситьОтвет Тогда
			ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
		КонецЕсли;
		
		ТаблицаИсторииВерсий = ПодготовитьТаблицуИсторииВерсий();
		
		Для Каждого Версия Из СписокВерсийСтруктура.versions Цикл
			
			Если Не ЗначениеЗаполнено(Версия.release_date) Тогда
				Продолжить;
			КонецЕсли;
			
			ВерсияМассивом = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(Версия.version, ".");
			
			СтрокаТаблицы = ТаблицаИсторииВерсий.Добавить();
			СтрокаТаблицы.НомерВерсии = Версия.version;
			СтрокаТаблицы.БазоваяВерсия = ВерсияМассивом[0] + "." + ВерсияМассивом[1];
			СтрокаТаблицы.ВерсияПатча = Число(ВерсияМассивом[2]);
			СтрокаТаблицы.ДатаВыхода = Версия.release_date;
			
			Попытка
				ОписаниеСтруктура = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Версия.description);
			Исключение
				ОписаниеСтруктура = Неопределено;
			КонецПопытки;
			
			Если ТипЗнч(ОписаниеСтруктура) = Тип("Структура") Тогда
				СтрокаТаблицы.СсылкаНаОписание = ОписаниеСтруктура.link;
				СтрокаТаблицы.КраткоеОписание = СтрЗаменить(ОписаниеСтруктура.description, "\n", Символы.ПС);
			КонецЕсли;
			
			Для Каждого СсылкаНаКонтент Из Версия.links Цикл
				Если СсылкаНаКонтент.content_type = "zip" Тогда
					СтрокаТаблицы.СсылкаНаЗагрузку = СсылкаНаКонтент.href;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		СтруктураРезультата.Успешно = Истина;
		СтруктураРезультата.ТаблицаИсторииВерсий = ТаблицаИсторииВерсий;
		
	Иначе
		СтруктураРезультата.Ошибка = Ответ.Ошибка;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
	
КонецПроцедуры

Функция ЗагрузитьДанные(СсылкаНаЗагрузку, АдресРезультата = Неопределено) Экспорт

	Ответ = СерверОбновлений_ЗагрузитьКонтент(СсылкаНаЗагрузку);

	Если Ответ.Успешно Тогда

		ДвоичныеДанныеОтвет = Ответ.ТелоОтвета;

		Если НЕ АдресРезультата = Неопределено Тогда

			ПоместитьВоВременноеХранилище(ДвоичныеДанныеОтвет, АдресРезультата);
			
		Иначе
			
			Возврат ДвоичныеДанныеОтвет;

		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение Ответ.Ошибка;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ХэшСуммаТекущегоРасширенияИЭталонногоОдинаковы(НомерВерсии) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ХэшСуммыОдинаковы", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	
	Ответ = СерверОбновлений_СодержимоеВерсии(НомерВерсии);
	
	Если Не Ответ.Успешно Тогда
		Результат.ТекстОшибки = Ответ.Ошибка;
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		ДанныеВерсии = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	Исключение
		Результат.ТекстОшибки = ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	
	// Получим хэш сумму исходного расширения
	ХэшСуммаЭталона = "";
	СписокКонтента = ДанныеВерсии.contents;
	Для Каждого ТекущаяСтрока Из СписокКонтента Цикл
		Если ТекущаяСтрока.name <> "zip" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.Свойство("src_checksum")
			И ЗначениеЗаполнено(ТекущаяСтрока.src_checksum) Тогда
			
			ХэшСуммаЭталона = ТекущаяСтрока.src_checksum;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Получим хэш сумму установленного расширения
	ОтборРасширения = Новый Структура("Имя", "РасширениеКонтурЛогистика");
	НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
	Если НайденныеРасширения.Количество() = 0 Тогда
		Результат.ТекстОшибки = "Не удалось найти текущее расширение.";
		Возврат Результат;
	КонецЕсли;
	ХэшСуммаУстановленного = Base64Строка(НайденныеРасширения[0].ХешСумма);
	
	// Сравним хэш суммы
	Если ХэшСуммаЭталона = ХэшСуммаУстановленного Тогда
		Результат.ХэшСуммыОдинаковы = Истина;
	КонецЕсли;
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьУведомленияИзСервиса(УчитыватьПоследнююДатуПолучения) Экспорт
	
	API_Логин = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ЛогинАвторизацииДиадокАПИ");
	Если Не ЗначениеЗаполнено(API_Логин) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСВнешнимиРесурсамиЗаблокирована = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"ПараметрыБлокировки_РаботаСВнешнимиРесурсамиЗаблокирована");
	Если РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат;
	КонецЕсли;
	
	Если УчитыватьПоследнююДатуПолучения Тогда
		// Проверим дату последнего получения
		ПоследняяДатаПолученияУведомлений = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ПоследняяДатаПолученияУведомлений");
		ЧасВСекундах = 60 * 60;
		
		Если ЗначениеЗаполнено(ПоследняяДатаПолученияУведомлений)
			И ПоследняяДатаПолученияУведомлений + ЧасВСекундах >= ТекущаяДатаСеанса() Тогда
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СерверОбновлений_СписокУведомлений();
	
	КонтурЛогистика_Привилегированный.УстановитьНастройку("ПоследняяДатаПолученияУведомлений", ТекущаяДатаСеанса());
	
КонецПроцедуры

Функция СостоянияУведомленийПользователя(ИмяФормы = Неопределено) Экспорт
	
	СостоянияУведомлений = Новый Структура;
	СостоянияУведомлений.Вставить("ВсегоУведомлений", 0);
	СостоянияУведомлений.Вставить("ВажныхУведомлений", 0);
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ЕстьОтборПоИмениФормы", ЗначениеЗаполнено(ИмяФормы));
	Запрос.УстановитьПараметр("ИмяФормы", ИмяФормы);
	
	Запрос.Текст = ТекстЗапросаНеПрочитанныхУведомленийПользователя();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СостоянияУведомлений.ВсегоУведомлений = СостоянияУведомлений.ВсегоУведомлений + 1;
		Если Выборка.Приоритет = "high" Тогда
			СостоянияУведомлений.ВажныхУведомлений = СостоянияУведомлений.ВажныхУведомлений + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СостоянияУведомлений;
	
КонецФункции

Функция ОбернутьТекстУведомленияВHTML(Текст) Экспорт
	
	Шаблон =
	"<!DOCTYPE html>
	|<html dir=""ltr"">
	|<head>
	|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
	|<meta name=""format-detection"" content=""telephone=no"" />
	|<style type=""text/css"">
	|body{margin:0;padding:8px;}
	|p{line-height:1.15;margin:0;white-space:pre-wrap;}
	|ol,ul{margin-top:0;margin-bottom:0;}
	|img{border:none;}
	|li>p{display:inline;}
	|</style>
	|</head>
	|<body>
	|<p>&Текст</p>
	|</body>
	|</html>";
	
	Возврат СтрЗаменить(Шаблон, "&Текст", Текст);
	
КонецФункции

// Получает функциональные опции с сервера обновлений и преобразует их в соответствие "ключ → значение".
//
// Функция выполняет HTTP-запрос к серверу обновлений, получает JSON-ответ,
// десериализует его и формирует структуру данных для удобного использования.
// При возникновении ошибок на любом этапе (запрос, разбор JSON) регистрируется
// диагностическое событие и возвращается пустое соответствие.
//
// Параметры отсутствуют.
//
// Возвращаемое значение:
//   Соответствие - коллекция вида { "ИмяОпции" => "ЗначениеОпции", ... }.
//   В случае ошибки - пустое соответствие (Новый Соответствие).
//
Функция ФункциональныеОпции() Экспорт
	
	Попытка
		Ответ = СерверОбновлений_ФункциональныеОпции();
	Исключение
		
		ТекстОшибки = "Не удалось получить функциональные опции.";
		КонтурЛогистика_Метрика.ОбработатьОшибку("КонтурЛогистикаФункциональныеОпции", ИнформацияОбОшибке(), , , ТекстОшибки);
		
		Возврат Новый Соответствие;
	КонецПопытки;
	
	Попытка
		МассивОпций = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	Исключение
		
		ТекстОшибки = "Не удалось разобрать список функциональных опций.";
		КонтурЛогистика_Метрика.ОбработатьОшибку("КонтурЛогистикаФункциональныеОпции", ИнформацияОбОшибке(), , , ТекстОшибки);
		
		Возврат Новый Соответствие;
		
	КонецПопытки;
	
	Результат = Новый Соответствие;
	
	Для Каждого СтруктураЗначения Из МассивОпций Цикл
		
		Результат.Вставить(СтруктураЗначения.feature, СтруктураЗначения.value); 
		
	КонецЦикла;
	
	Возврат Результат;			
		
КонецФункции

#Область ОбновлениеДопРасширений

Функция ПроверитьОбновления(Адрес, ВидРасширения = "", УникальныйИдентификатор, ПринудительнаяПроверка = Ложь) Экспорт
	
	Если ПринудительнаяПроверка Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ПравоДоступа("АдминистрированиеРасширенийКонфигурации",Метаданные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяКонфигурации1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	ОтборРасширения = Новый Структура;
	Если ВидРасширения = "ДополнительныеРеквизиты" Тогда
		ОтборРасширения.Вставить("Имя", КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер.ИмяДополнительногоРасширенияДополнительныеРеквизитыПоИмениКонфигурации(
			ИмяКонфигурации1С));
	ИначеЕсли ВидРасширения = "QR_МП_УАТ" Тогда
		ОтборРасширения.Вставить("Имя", "РасширениеКонтурЛогистика_QR_МП_УАТ");
	Иначе
		ОтборРасширения.Вставить("Имя", КонтурЛогистика_ИнтеграцияТиповыеСервер.ИмяДополнительногоРасширенияПоИмениКонфигурации(
			ИмяКонфигурации1С));
	КонецЕсли;
	
	НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
	
	Если ВидРасширения = "QR_МП_УАТ" И НайденныеРасширения.Количество() = 0 Тогда
		ОтборРасширения.Вставить("Имя", "РасширениеКонтурЛогистика_QR_МП_УАТ_33");
		НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
	КонецЕсли;
	
	Если НайденныеРасширения.Количество() = 0 Тогда
		ТекущаяВерсияДополнительногоРасширения = "0.0.0";
	ИначеЕсли ВидРасширения = "QR_МП_УАТ" И КонтурЛогистика_ОбновлениеСерверПовтИсп.ТребуетсяОбновление_НоваяВерсияУАТ_QR_МП_УАТ() Тогда
		// Расширение для нового УАТ находится в пакете обновления той же версии, эта версия может быть уже установлена
		ТекущаяВерсияДополнительногоРасширения = "0.0.0";
	Иначе
		ТекущаяВерсияДополнительногоРасширения = НайденныеРасширения[0].Версия;
	КонецЕсли;
		
	Адрес = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("НомерВерсии", ТекущаяВерсияДополнительногоРасширения);
	
	Если ВидРасширения = "ДополнительныеРеквизиты" Тогда
		ПараметрыФоновогоЗадания.Вставить("ИмяРасширения", "ДополнительныеРеквизитыРасширение");
	ИначеЕсли ВидРасширения = "QR_МП_УАТ" Тогда
		ПараметрыФоновогоЗадания.Вставить("ИмяРасширения", "QR_МП_УАТ_Расширение");
	Иначе
		ПараметрыФоновогоЗадания.Вставить("ИмяРасширения", "ДополнительноеРасширение");
	КонецЕсли;
	
	РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьВФоне(
		"КонтурЛогистика_ДлительныеОперацииСервер.ПолучитьСведенияОбОбновлении",
		ПараметрыФоновогоЗадания,, "Получение сведений о последней версии", Адрес);
	
	Возврат РезультатЗапуска;
	
КонецФункции

Функция УстановитьОбновление(Адрес, ИмяКонфигурации1С, ВидРасширения = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	ДвоичныеДанныеОтвет = ПолучитьИзВременногоХранилища(Адрес);
	
	Если ДвоичныеДанныеОтвет = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		
		// Получим старую версию
		Если ВидРасширения = "ДополнительныеРеквизиты" Тогда
			ИмяРасширения = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер.ИмяДополнительногоРасширенияДополнительныеРеквизитыПоИмениКонфигурации(ИмяКонфигурации1С);	
		ИначеЕсли ВидРасширения = "QR_МП_УАТ" Тогда
			ИмяРасширения = "РасширениеКонтурЛогистика_QR_МП_УАТ";
		Иначе
			ИмяРасширения = КонтурЛогистика_ИнтеграцияТиповыеСервер.ИмяДополнительногоРасширенияПоИмениКонфигурации(ИмяКонфигурации1С);
		КонецЕсли;
		ОтборРасширения = Новый Структура;
		ОтборРасширения.Вставить("Имя", ИмяРасширения);
		
		НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
		
		Если ВидРасширения = "QR_МП_УАТ" И НайденныеРасширения.Количество() = 0 Тогда
			ОтборРасширения.Вставить("Имя", "РасширениеКонтурЛогистика_QR_МП_УАТ_33");
			НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
		КонецЕсли;
		
		Если НайденныеРасширения.Количество() = 0 Тогда
			ТекущееРасширение = РасширенияКонфигурации.Создать();
		Иначе
			ТекущееРасширение = НайденныеРасширения[0];
		КонецЕсли;
		
		Если ВидРасширения = "ДополнительныеРеквизиты" Тогда
			
			ДвоичныеДанныеФайла = ДвоичныеДанныеОтвет;
			
		ИначеЕсли ВидРасширения = "QR_МП_УАТ" Тогда
			
			Если КонтурЛогистика_ОбновлениеСерверПовтИсп.ТребуетсяОбновление_НоваяВерсияУАТ_QR_МП_УАТ()
				И  ТекущееРасширение.Имя = "РасширениеКонтурЛогистика_QR_МП_УАТ_33" Тогда
				
				ТекущееРасширение.Удалить();
				ТекущееРасширение = РасширенияКонфигурации.Создать();
				
			КонецЕсли;
			
			Если КонтурЛогистика_ОбновлениеСерверПовтИсп.НоваяВерсияУАТ_QR_МП_УАТ(ИмяКонфигурации1С) Тогда
				ИмяФайлаРасширения = "РасширениеКонтурЛогистика_QR_МП_УАТ.cfe";
			Иначе
				ИмяФайлаРасширения = "РасширениеКонтурЛогистика_QR_МП_УАТ_33.cfe";
			КонецЕсли;
			
			ДвоичныеДанныеФайла = РазархивироватьПолученныйПакетОбновления(ДвоичныеДанныеОтвет, ИмяФайлаРасширения);
						
		Иначе
			
			Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ВерсияСтандартнойПодсистемыВыше_3_1_8() Тогда
				ИмяФайлаРасширения = "РасширениеКонтурЛогистика_Дополнение.cfe";
			Иначе
				ИмяФайлаРасширения = "РасширениеКонтурЛогистика_Дополнение_ДоБСП_3_1_8.cfe";
			КонецЕсли;
			
			ДвоичныеДанныеФайла = РазархивироватьПолученныйПакетОбновления(ДвоичныеДанныеОтвет, ИмяФайлаРасширения);
			
		КонецЕсли;
		
		Если ДвоичныеДанныеФайла = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Проверим возможность применения
		ИтогиПроверки = ТекущееРасширение.ПроверитьВозможностьПрименения(ДвоичныеДанныеФайла);
		Если ИтогиПроверки.Количество() <> 0 Тогда
			Сообщить("Проблемы применения расширения:");
			Для Каждого ТекущийИтог Из ИтогиПроверки Цикл
				Сообщить("- " + ТекущийИтог.Описание);
			КонецЦикла;
			
			Возврат Ложь;
		КонецЕсли;
		
		// Запишем расширение
		ТекущееРасширение.БезопасныйРежим = Ложь;
		ТекущееРасширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		ТекущееРасширение.Записать(ДвоичныеДанныеФайла);
		
	Исключение
		ТекстОшибки = "Не удалось обновить расширение по причине:
			|" + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция РазархивироватьПолученныйПакетОбновления(ДвоичныеДанныеОтвет, ИмяФайлаРасширения) 
	
	ДвоичныеДанныеФайла = Неопределено;
	
	// Разархивируем полученный пакет
	ЧтениеДанныхАрхив = Новый ЧтениеДанных(ДвоичныеДанныеОтвет);
	ПапкаДляРаспаковки = КаталогВременныхФайлов() + "KonturLogist";
	
	ЧтениеZIP = Новый ЧтениеZIPФайла(ЧтениеДанныхАрхив.ИсходныйПоток());
	ЧтениеZIP.ИзвлечьВсе(ПапкаДляРаспаковки);
	ЧтениеZIP.Закрыть();
				
	// Ищем в файлах расширение
	ФайлыЭД = НайтиФайлы(ПапкаДляРаспаковки, ИмяФайлаРасширения);
	Если ФайлыЭД.Количество() > 0 Тогда
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ФайлыЭД[0].ПолноеИмя);
	Иначе
		Сообщить("Ошибка при распаковке ответа сервиса обновлений Контур");		
	КонецЕсли;
	
	// Подчищаем следы
	Попытка
		Выполнить("ФайловаяСистема.УдалитьВременныйКаталог(ПапкаДляРаспаковки)");
	Исключение
		// Ничего не делаем, если не удалось удалить временные файлы.
	КонецПопытки;
	
	Возврат ДвоичныеДанныеФайла;
	
КонецФункции

#КонецОбласти

#Область Документация

Функция ПолучитьОнбординг(ИдентификаторОнбординга) Экспорт
	
	ВерсияПодсистемы = КонтурЛогистика_ОбновлениеВерсииМодуля.ТекущаяВерсияПодсистемыКонтурЛогистика();
	ИмяПродукта = "logist_onboarding";
	
	Попытка
		Ответ = СерверОбновлений_ПолучитьИсториюВерсий(ИмяПродукта);
	Исключение
		
		ТекстОшибки = "Не удалось получить историю версий.
		|Ошибка: " + ОписаниеОшибки();
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
		Возврат Неопределено;
	КонецПопытки;
	
	Попытка
		СписокВерсийСтруктура = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	Исключение
		
		ТекстОшибки = "Не удалось разобрать историю версий.
		|Ошибка: " + ОписаниеОшибки();
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
		Возврат Неопределено;
	КонецПопытки;
	
	Для Каждого Версия Из СписокВерсийСтруктура.versions Цикл
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияПодсистемы, Версия.version) < 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Контент Из Версия.links Цикл
			
			Если Контент.content_type <> ИдентификаторОнбординга Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				ДвоичныеДанныеОтвет = ЗагрузитьДанные(Контент.href);
			Исключение
				
				ТекстОшибки = "Не удалось скачать данные версии.
				|Ошибка: " + ОписаниеОшибки();
				
				ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
				
				Возврат Неопределено;
			КонецПопытки;
			
			Попытка
				Результат = ПолучитьМиниТурОнбординга(ДвоичныеДанныеОтвет, ИдентификаторОнбординга);
				Возврат Результат;
			Исключение
				
				ТекстОшибки = "Не удалось прочитать данные по онбордингу.
				|Ошибка: " + ОписаниеОшибки();
				
				ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
				
				Возврат Неопределено;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;

	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьМиниТурОнбординга(ДвоичныеДанные, ИдентификаторОнбординга)
	
	ЧтениеДанныхАрхив = Новый ЧтениеДанных(ДвоичныеДанные);
	ПапкаДляРаспаковки = КаталогВременныхФайлов() + "KonturLogist";
	
	ЧтениеZIP = Новый ЧтениеZIPФайла(ЧтениеДанныхАрхив.ИсходныйПоток());
	ЧтениеZIP.ИзвлечьВсе(ПапкаДляРаспаковки);
	ЧтениеZIP.Закрыть();
	
	НайденныеФайлы = НайтиФайлы(ПапкаДляРаспаковки + "\" + ИдентификаторОнбординга, "*.*");
	
	Результат = Новый Массив;
	
	Номер = 1;
	
	Пока Истина Цикл
		
		ИмяФайла = ПапкаДляРаспаковки + "\" + ИдентификаторОнбординга + "\" + Номер + ".html";
		
		МойФайл = Новый Файл(ИмяФайла);
		
		Если НЕ МойФайл.Существует() Тогда 
			Прервать;
		КонецЕсли;
		
		ТекстовыйФайл = Новый ТекстовыйДокумент;
		ТекстовыйФайл.Прочитать(МойФайл.ПолноеИмя, КодировкаТекста.UTF8);
		
		Результат.Добавить(ТекстовыйФайл.ПолучитьТекст());
		
		Номер = Номер + 1;
		
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		
		НайденныеФайлы = НайтиФайлы(ПапкаДляРаспаковки + "\" + ИдентификаторОнбординга, "*.*");
		
		Для Каждого НайденныйФайл Из НайденныеФайлы Цикл
			ТекстовыйФайл = Новый ТекстовыйДокумент;
			ТекстовыйФайл.Прочитать(НайденныйФайл.ПолноеИмя, КодировкаТекста.UTF8);
			
			Результат.Добавить(ТекстовыйФайл.ПолучитьТекст());
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		Выполнить("ФайловаяСистема.УдалитьВременныйКаталог(ПапкаДляРаспаковки)");
	Исключение
		НичегоНеДелаем = Истина;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДокументацию(ИмяФайла, ТолькоСодержимое = Истина) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Содержимое", "");
	Результат.Вставить("Ошибка", "");
	
	// Получим последнюю версию
	Ответ = СерверОбновлений_ПроверитьНовуюВерсию("1", "logist_docs");
	Если Ответ.Успешно Тогда
		
		ДвоичныеДанныеОтвет = Неопределено;
		
		Попытка
			ДанныеОбновления = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
		Исключение
			Результат.Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Возврат Результат;
		КонецПопытки;
		
		Для Каждого СсылкаНаКонтент Из ДанныеОбновления.links Цикл
			
			Если СсылкаНаКонтент.content_type <> "zip" Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				// Загрузим контент
				ДвоичныеДанныеОтвет = ЗагрузитьДанные(СсылкаНаКонтент.href);
				Прервать;
			Исключение
				Результат.Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Возврат Результат;
			КонецПопытки;
			
		КонецЦикла;
		
		Если ДвоичныеДанныеОтвет = Неопределено Тогда
			Результат.Ошибка = "Не удалось получить двоичные данныее";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Содержимое = РазархивироватьПолученныйПакетДокументации(ДвоичныеДанныеОтвет, ИмяФайла, ТолькоСодержимое);
		
	Иначе
		
		Результат.Ошибка = Ответ.Ошибка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазархивироватьПолученныйПакетДокументации(ДвоичныеДанныеОтвет, ИмяФайла, ТолькоСодержимое)
	
	// Разархивируем полученный пакет
	ЧтениеДанныхАрхив = Новый ЧтениеДанных(ДвоичныеДанныеОтвет);
	ПапкаДляРаспаковки = КаталогВременныхФайлов() + "KonturLogist";
	
	ЧтениеZIP = Новый ЧтениеZIPФайла(ЧтениеДанныхАрхив.ИсходныйПоток());
	ЧтениеZIP.ИзвлечьВсе(ПапкаДляРаспаковки);
	ЧтениеZIP.Закрыть();
	
	// Ищем в файлах нужный
	ПолноеИмяФайлаВПакете = "";
	ФайлыЭД = НайтиФайлы(ПапкаДляРаспаковки, ИмяФайла);
	Если ФайлыЭД.Количество() > 0 Тогда
		ПолноеИмяФайлаВПакете = ФайлыЭД[0].ПолноеИмя;
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если ТолькоСодержимое Тогда
		
		// Получим содержимое
		ТекстовыйФайл = Новый ТекстовыйДокумент;
		ТекстовыйФайл.Прочитать(ПолноеИмяФайлаВПакете, КодировкаТекста.UTF8);
		
		Результат = ТекстовыйФайл.ПолучитьТекст();
		
		ТекстовыйФайл = Неопределено;
		
	Иначе
		
		Результат = Новый ДвоичныеДанные(ПолноеИмяФайлаВПакете);
		
	КонецЕсли;
	
	// Подчищаем следы
	Попытка
		Выполнить("ФайловаяСистема.УдалитьВременныйКаталог(ПапкаДляРаспаковки)");
	Исключение
		НичегоНеДелаем = Истина;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтруктурыДанных

Функция ПодготовитьСтруктуруОбновленияВерсии()
	
	СтруктураОбновленияВерсии = Новый Структура();
	
	СтруктураОбновленияВерсии.Вставить("Успешно", Ложь);
	СтруктураОбновленияВерсии.Вставить("Ошибка", "");
	СтруктураОбновленияВерсии.Вставить("ЕстьОбновление", Ложь);
	СтруктураОбновленияВерсии.Вставить("НомерВерсии", "");
	СтруктураОбновленияВерсии.Вставить("ДатаВыхода", "");
	СтруктураОбновленияВерсии.Вставить("СсылкаНаОписание", "");
	СтруктураОбновленияВерсии.Вставить("КраткоеОписание", "");
	СтруктураОбновленияВерсии.Вставить("СсылкаНаЗагрузку", "");
	
	Возврат СтруктураОбновленияВерсии;
	
КонецФункции

Функция ПодготовитьТаблицуИсторииВерсий()
	
	ТаблицаИсторииВерсий = Новый ТаблицаЗначений;
	
	ТаблицаИсторииВерсий.Колонки.Добавить("НомерВерсии");
	ТаблицаИсторииВерсий.Колонки.Добавить("ДатаВыхода");
	ТаблицаИсторииВерсий.Колонки.Добавить("СсылкаНаОписание");
	ТаблицаИсторииВерсий.Колонки.Добавить("СсылкаНаЗагрузку");
	ТаблицаИсторииВерсий.Колонки.Добавить("БазоваяВерсия");
	ТаблицаИсторииВерсий.Колонки.Добавить("ВерсияПатча");
	ТаблицаИсторииВерсий.Колонки.Добавить("КраткоеОписание");
	
	Возврат ТаблицаИсторииВерсий;
	
КонецФункции

#КонецОбласти

#Область ОбменССервисом

Функция СерверОбновлений_ПроверитьНовуюВерсию(НомерВерсии, ИмяПродукта)
	
	//https://update.kontur.ru/1c/v2/logist/check/1
	
	АдресМетода = "/1c/v2/" + ИмяПродукта + "/check/" + НомерВерсии;
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	
	Возврат ВыполнитьHTTPЗапрос_СерверОбновлений(АдресМетода, ПараметрыЗапроса);
	
КонецФункции

Функция СерверОбновлений_ПолучитьИсториюВерсий(ИмяПродукта, КоличествоВерсий = 10, НомерВерсии = Неопределено)
	
	//https://update.kontur.ru/1c/v2/logist/versions_list
	
	АдресМетода = "/1c/v2/" + ИмяПродукта + "/versions_list";
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	
	Заголовки = ПараметрыЗапроса.Заголовки;
	Заголовки.Вставить("versions_count", КоличествоВерсий);
	
	Возврат ВыполнитьHTTPЗапрос_СерверОбновлений(АдресМетода, ПараметрыЗапроса);	
	
КонецФункции

Функция СерверОбновлений_ЗагрузитьКонтент(АдресКонтента) 
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса(); 
	ПараметрыЗапроса.Вставить("ТелоОтвета", Новый Структура("ДвоичныеДанные")); 
	
	Возврат ВыполнитьHTTPЗапрос_СерверОбновлений(АдресКонтента, ПараметрыЗапроса, Истина);	
	
КонецФункции

Функция СерверОбновлений_СодержимоеВерсии(НомерВерсии)
	
	//https://update.kontur.ru/1c/v4/products/logist_ka_2_5/versions/0.12.1/contents
	
	АдресМетода = "/1c/v4/products/" + ИмяПродукта() + "/versions/" + НомерВерсии + "/contents";
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	
	Возврат ВыполнитьHTTPЗапрос_СерверОбновлений(АдресМетода, ПараметрыЗапроса);
	
КонецФункции

Процедура СерверОбновлений_СписокУведомлений()
	
	АдресМетода = "/1c/v4/logist/notifications";
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	ФильтрОтбораУведомлений = КонтурЛогистика_ОбновлениеСерверПовтИсп.ФильтрОтбораУведомлений();
	ПараметрыЗапроса.ТелоЗапроса.string = КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(ФильтрОтбораУведомлений);
	
	Ответ = ВыполнитьHTTPЗапрос_СерверОбновлений(АдресМетода, ПараметрыЗапроса);
	
	Если Ответ.Успешно Тогда
		Попытка
			ОбновитьУведомленияПродукта(Ответ.ТелоОтвета);
		Исключение
			КонтурЛогистика_Метрика.ОбработатьОшибку("СерверОбновлений_СписокУведомлений", ИнформацияОбОшибке());
		КонецПопытки;
	Иначе
		Если ЗначениеЗаполнено(Ответ.Ошибка) Тогда
			КонтурЛогистика_Метрика.ОбработатьОшибку("СерверОбновлений_СписокУведомлений", Ответ.Ошибка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Получает список функциональных опций с сервиса обновлений
//
// Возвращаемое значение:
//   Ответ - см. ВыполнитьHTTPЗапрос_СерверОбновлений 
//
Функция СерверОбновлений_ФункциональныеОпции()
	
	Метод = "GET";
	АдресМетода = "/1c/v4/products/logistics-func-opt/features";
	
	ЗаголовкиЗапроса = Новый Соответствие;
	ЗаголовкиЗапроса.Вставить("Content-Type", "application/json");
	ЗаголовкиЗапроса.Вставить("accept", "application/json");
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	ПараметрыЗапроса.Метод = Метод;
	ПараметрыЗапроса.Заголовки = ЗаголовкиЗапроса;
	
	customer_id = КонтурЛогистика_Метрика.ИдентификаторИБ();
	Если ЗначениеЗаполнено(customer_id) Тогда
		ПараметрыЗапроса.Параметры.Вставить("customer_id", customer_id);
	КонецЕсли;
	
	Возврат ВыполнитьHTTPЗапрос_СерверОбновлений(АдресМетода, ПараметрыЗапроса);

КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедуры

Функция ВыполнитьHTTPЗапрос_СерверОбновлений(АдресМетода, ПараметрыЗапроса, ПередаетсяПолныйАдрес = Ложь)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Успешно", Ложь);
	СтруктураОтвета.Вставить("Ошибка", "");
	СтруктураОтвета.Вставить("ТелоОтвета", "");
	
	Если Не ПередаетсяПолныйАдрес Тогда
		АдресМетода = ПараметрыСервераОбновлений().Адрес + АдресМетода;
	КонецЕсли;
	
	ЗапросВыполненУспешно = Ложь;
	
	Попытка
		РезультатЗапроса = КонтурЛогистика_HTTPТранспортКлиентСервер.ВыполнитьHTTPЗапрос(АдресМетода, ПараметрыЗапроса);
		ЗапросВыполненУспешно = Истина;
	Исключение
		СтруктураОтвета.Ошибка = ОписаниеОшибки();
	КонецПопытки;
	
	Если ЗапросВыполненУспешно Тогда	
		Если СокрЛП(РезультатЗапроса.КодСостояния) = "200" Тогда
			СтруктураОтвета.Успешно = Истина;
			СтруктураОтвета.ТелоОтвета = РезультатЗапроса.ТелоОтвета;
		Иначе
			СтруктураОтвета.Ошибка = РезультатЗапроса.ТелоОтвета;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция НовыеПараметрыHTTPЗапроса()
	
	Таймаут = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ТаймаутHTTP");
	
	Результат = Новый Структура;
	
	Результат.Вставить("Метод", "GET");
	Результат.Вставить("Таймаут", Таймаут);
	
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("Параметры", Новый Соответствие);
	
	Результат.Вставить("ТелоЗапроса", Новый Структура("string", "")); // ТелоЗапроса пустая строка
	Результат.Вставить("ТелоОтвета" , Новый Структура("string", "")); // ТелоОтвета вернуть строкой в кодировке сервера
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыСервераОбновлений()
	
	СтруктураПараметровСервераОбновлений = Новый Структура;
	
	ИспользуетсяТестовыйАПИ = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	
	Если ИспользуетсяТестовыйАПИ Тогда
		
		СтруктураПараметровСервераОбновлений.Вставить("Адрес", АдресТестовогоСервераОбновлений());
		
	Иначе
		
		СтруктураПараметровСервераОбновлений.Вставить("Адрес", АдресПродуктивногоСервераОбновлений());
		
	КонецЕсли;
	
	Возврат СтруктураПараметровСервераОбновлений;
	
КонецФункции

Функция АдресТестовогоСервераОбновлений()
	
	Возврат "https://update.testkontur.ru";
	
КонецФункции

Функция АдресПродуктивногоСервераОбновлений()
	
	Возврат "https://update.kontur.ru";
	
КонецФункции

Функция ИмяПродукта(ИмяРасширения = "")

	ИмяПродукта = БазовоеИмяПродукта();
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширение() Тогда 
		
		// Так как и УТ и ERP могут быть двух версий *.4 или *.5.
		Если ИмяКонфигурации = "УФ_УТ"
			Или ИмяКонфигурации = "ERP" Тогда
			
			НомерРедакции = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(Метаданные.Версия, ".")[1];
			
			Если Число(НомерРедакции) > 4 Тогда
				
				ИмяКонфигурации = "УФ_УТ_11_5";
				
				Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоРасширениеGLN() Тогда
					ИмяКонфигурации = "УФ_УТ_11_5_DEF_GLN";	
				КонецЕсли;
				
			Иначе
				
				ИмяКонфигурации = "УФ_УТ_11_4";
				
			КонецЕсли;
			
		ИначеЕсли ИмяКонфигурации = "УФ_БП" Тогда
			
			Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоРасширениеGLN() Тогда
				ИмяКонфигурации = "УФ_БП_DEF_GLN";	
			КонецЕсли;
			
		КонецЕсли;
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширениеСОпределяемымиТипами() Тогда
			ИмяКонфигурации = "УФ";			
		КонецЕсли;
		
		Если Не ИмяКонфигурации = Неопределено Тогда 
			
			Соответствие = СоответствиеИмениКонфигурацииПродуктуВСервисеОбновлений();
			
			ИмяПродукта = Соответствие.Получить(ИмяКонфигурации);
			
			Если ИмяПродукта = Неопределено Тогда 
				
				ВызватьИсключение "Не найдено продукта в сервисе обновлений для конфигурации " + ИмяКонфигурации;
				
			КонецЕсли;
			
			Если ИмяРасширения = "ДополнительноеРасширение" Тогда
				ИмяПродукта = "logist_addon";
			ИначеЕсли ИмяРасширения = "ДополнительныеРеквизитыРасширение" Тогда
				ИмяПродукта = СтрЗаменить(ИмяПродукта, "logist_", "logist_additional_meta_");
			ИначеЕсли ИмяРасширения = "QR_МП_УАТ_Расширение" Тогда
				ИмяПродукта = СтрЗаменить(ИмяПродукта, "logist_", "logist_qr_");
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда
			ИмяПродукта = "logist_subsystem_8_2";	
		КонецЕсли;
		
		Если ИмяКонфигурации = "УТ" И Найти(Метаданные.Версия, "10.3") > 0 Тогда
			ИмяПродукта = "logist_subsystem_ut_10";	
		ИначеЕсли ИмяКонфигурации = "УПП" Тогда
			ИмяПродукта = "logist_subsystem_upp";	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяПродукта;
	
КонецФункции

Функция БазовоеИмяПродукта()
	
	Возврат "logist_subsystem_8_3";
	
КонецФункции

Функция СоответствиеИмениКонфигурацииПродуктуВСервисеОбновлений()
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("КЛ", 	"logist_subsystem_8_3");
	Соответствие.Вставить("ERP", 	"logist_ut_11_5");
	Соответствие.Вставить("КА_2", 	"logist_ka_2_5");
	Соответствие.Вставить("УФ_БП", 	"logist_buh_3_0");
	Соответствие.Вставить("УФ_БП_DEF_GLN", 	"logist_buh_3_0_def_gln");
	Соответствие.Вставить("УФ_УНФ", "logist_unf_1_6");
	
	Соответствие.Вставить("УФ_УТ_11_4", "logist_ut_11");
	Соответствие.Вставить("УФ_УТ_11_5", "logist_ut_11_5");
	Соответствие.Вставить("УФ_УТ_11_5_DEF_GLN", "logist_ut_11_5_def_gln");
	
	Соответствие.Вставить("УАТ_ПРОФ", "logist_uat_prof_2_2");
	Соответствие.Вставить("УАТ", "logist_uat_2_2");
	Соответствие.Вставить("ТЛЭ", "logist_uat_prof_2_2");
	Соответствие.Вставить("ERP_УАТ", "logist_erp_uat_2_5");
	
	Соответствие.Вставить("УФ", "logist_cfe_def");
	
	Возврат Соответствие;
	
КонецФункции

#Область РаботаСУведомленими

Процедура ОбновитьУведомленияПродукта(ТелоОтвета)
	
	ОбъектОтвета = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(ТелоОтвета);
	// Пример - ОбъектОтвета.notifications:
	//	content
	//		body		""
	//		title		"Тестовый заголовок"
	//		type		"html"
	//		form_name	"Имя формы"		Массив (не обязательное)
	//	date_from	"2025-06-01"
	//	date_to		"2025-06-30"
	//	id			"dffaced2-5e36-4a13-9bf8-c7675a0690d1"
	//	priority	"high"
	
	НовыеУведомления = Новый Массив;
	
	// Соберем идентификаторы
	КвалификаторыСтроки = Новый КвалификаторыСтроки(36);
	ИДВходящихУведомлений = Новый ТаблицаЗначений;
	ИДВходящихУведомлений.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка",, КвалификаторыСтроки));
	Для Каждого ТекущаяСтрока Из ОбъектОтвета.notifications Цикл
		НоваяСтрока = ИДВходящихУведомлений.Добавить();
		НоваяСтрока.Идентификатор = ТекущаяСтрока.id;
	КонецЦикла;
	
	// Получим по идентификаторам новые и на удаление уведомления
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИДВходящихУведомлений", ИДВходящихУведомлений);
	Запрос.Текст = ТекстЗапросаОбновленияУведомлений();
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаНовые = Результат[2].Выбрать();
	ВыборкаНаУдаление = Результат[3].Выбрать();
	
	// Создадим новые
	Пока ВыборкаНовые.Следующий() Цикл
		Для Каждого ТекущаяСтрока Из ОбъектОтвета.notifications Цикл
			Если ТекущаяСтрока.id <> ВыборкаНовые.Идентификатор Тогда
				Продолжить;
			КонецЕсли;
			
			НовоеУведомление = Справочники.КонтурЛогистика_УведомленияПродукта.СоздатьЭлемент();
			НовоеУведомление.Наименование = СокрЛП(ТекущаяСтрока.content.title);
			НовоеУведомление.Идентификатор = СокрЛП(ТекущаяСтрока.id);
			НовоеУведомление.ДатаНачала = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СтрокаВДатуЛок(СокрЛП(ТекущаяСтрока.date_from));
			НовоеУведомление.ДатаОкончания = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СтрокаВДатуЛок(СокрЛП(ТекущаяСтрока.date_to));
			НовоеУведомление.ТипКонтента = СокрЛП(ТекущаяСтрока.content.type);
			НовоеУведомление.Текст = СокрЛП(ТекущаяСтрока.content.body);
			НовоеУведомление.Приоритет = СокрЛП(ТекущаяСтрока.priority);
			
			Если ТекущаяСтрока.content.Свойство("form_name") Тогда
				Для Каждого form_name Из ТекущаяСтрока.content.form_name Цикл
					НовоеИмяФормы = НовоеУведомление.ИменаФорм.Добавить();
					НовоеИмяФормы.ИмяФормы = СокрЛП(form_name);
				КонецЦикла;
			КонецЕсли;
			
			НовоеУведомление.Записать();
			
			НовыеУведомления.Добавить(НовоеУведомление.Ссылка);
		КонецЦикла;
	КонецЦикла;
	
	// Удалим не актуальные
	Пока ВыборкаНаУдаление.Следующий() Цикл
		УведомлениеОбъект = ВыборкаНаУдаление.Ссылка.ПолучитьОбъект();
		УведомлениеОбъект.Удалить();
	КонецЦикла;
	
	Если НовыеУведомления.Количество() <> 0 Тогда
		
		// Отправим новые уведомления администратору
		
		// Телефон
		КонтактыАдминистратора_Телефоны = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("КонтактыАдминистратора_Телефоны");
		ИспользоватьОтправкуВТелеграм = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
		Если ЗначениеЗаполнено(КонтактыАдминистратора_Телефоны) И ИспользоватьОтправкуВТелеграм Тогда
			Телефоны = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(КонтактыАдминистратора_Телефоны, ";", Ложь);
			Для Каждого ТекущееУведомление Из НовыеУведомления Цикл
				ПоставитьСообщениеВОчередьНаОтправкуВТелеграм(Телефоны, ТекущееУведомление);
			КонецЦикла;
		КонецЕсли;
		
		// Электронные адреса
		КонтактыАдминистратора_Адреса = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("КонтактыАдминистратора_АдресаЭлектронныхПочт");
		ИспользоватьОтправкуНаПочту = КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
		Если ЗначениеЗаполнено(КонтактыАдминистратора_Адреса) И ИспользоватьОтправкуНаПочту Тогда
			Адреса = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(КонтактыАдминистратора_Адреса, ";", Ложь);
			Для Каждого ТекущееУведомление Из НовыеУведомления Цикл
				ОтправитьСообщениеНаАдресЭлектроннойПочты(Адреса, ТекущееУведомление);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаОбновленияУведомлений()
	
	Возврат
	"ВЫБРАТЬ
	|	ИДВходящихУведомлений.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВходящиеИдентификаторы
	|ИЗ
	|	&ИДВходящихУведомлений КАК ИДВходящихУведомлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВходящиеИдентификаторы.Идентификатор КАК Идентификатор,
	|	ЕСТЬNULL(КонтурЛогистика_УведомленияПродукта.Ссылка, ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_УведомленияПродукта.ПустаяСсылка)) КАК Уведомление
	|ПОМЕСТИТЬ ВходящиеУведомления
	|ИЗ
	|	ВходящиеИдентификаторы КАК ВходящиеИдентификаторы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_УведомленияПродукта КАК КонтурЛогистика_УведомленияПродукта
	|		ПО ВходящиеИдентификаторы.Идентификатор = КонтурЛогистика_УведомленияПродукта.Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВходящиеУведомления.Идентификатор КАК Идентификатор
	|ИЗ
	|	ВходящиеУведомления КАК ВходящиеУведомления
	|ГДЕ
	|	ВходящиеУведомления.Уведомление = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_УведомленияПродукта.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_УведомленияПродукта.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_УведомленияПродукта КАК КонтурЛогистика_УведомленияПродукта
	|ГДЕ
	|	НЕ КонтурЛогистика_УведомленияПродукта.Идентификатор В
	|				(ВЫБРАТЬ
	|					ВходящиеИдентификаторы.Идентификатор КАК Идентификатор
	|				ИЗ
	|					ВходящиеИдентификаторы КАК ВходящиеИдентификаторы)";
	
КонецФункции

Функция ТекстЗапросаУведомленийПользователя()
	
	Возврат
	"ВЫБРАТЬ
	|	КонтурЛогистика_УведомленияПродукта.Ссылка КАК Ссылка,
	|	МАКСИМУМ(КонтурЛогистика_УведомленияПродукта.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ УведомленияПродуктаПоИмениФормы
	|ИЗ
	|	Справочник.КонтурЛогистика_УведомленияПродукта КАК КонтурЛогистика_УведомленияПродукта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_УведомленияПродукта.ИменаФорм КАК КонтурЛогистика_УведомленияПродуктаИменаФорм
	|		ПО (КонтурЛогистика_УведомленияПродуктаИменаФорм.Ссылка = КонтурЛогистика_УведомленияПродукта.Ссылка)
	|ГДЕ
	|	НЕ КонтурЛогистика_УведомленияПродукта.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА КонтурЛогистика_УведомленияПродукта.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КонтурЛогистика_УведомленияПродукта.ДатаНачала <= &ТекущаяДата
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА КонтурЛогистика_УведомленияПродукта.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КонтурЛогистика_УведомленияПродукта.ДатаОкончания >= &ТекущаяДата
	|		КОНЕЦ
	|	И (НЕ &ЕстьОтборПоИмениФормы
	|				И НЕ КонтурЛогистика_УведомленияПродукта.Ссылка В
	|						(ВЫБРАТЬ
	|							УведомленияПродуктаИменаФорм.Ссылка КАК Уведомление
	|						ИЗ
	|							Справочник.КонтурЛогистика_УведомленияПродукта.ИменаФорм КАК УведомленияПродуктаИменаФорм)
	|			ИЛИ &ЕстьОтборПоИмениФормы
	|				И КонтурЛогистика_УведомленияПродуктаИменаФорм.ИмяФормы = &ИмяФормы)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_УведомленияПродукта.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_УведомленияПродукта.Ссылка КАК Уведомление,
	|	КонтурЛогистика_УведомленияПродукта.Приоритет КАК Приоритет,
	|	ЕСТЬNULL(КонтурЛогистика_УведомленияПользователя.Прочитано, ЛОЖЬ) КАК Прочитано
	|ПОМЕСТИТЬ УведомленияПродукта
	|ИЗ
	|	УведомленияПродуктаПоИмениФормы КАК КонтурЛогистика_УведомленияПродукта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_УведомленияПользователя КАК КонтурЛогистика_УведомленияПользователя
	|		ПО КонтурЛогистика_УведомленияПродукта.Ссылка = КонтурЛогистика_УведомленияПользователя.Уведомление
	|			И (КонтурЛогистика_УведомленияПользователя.Пользователь1С = &ТекущийПользователь)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
КонецФункции

Функция ТекстЗапросаНеПрочитанныхУведомленийПользователя()
	
	Возврат ТекстЗапросаУведомленийПользователя() +
	"ВЫБРАТЬ
	|	УведомленияПродукта.Уведомление КАК Уведомление,
	|	УведомленияПродукта.Приоритет КАК Приоритет
	|ИЗ
	|	УведомленияПродукта КАК УведомленияПродукта
	|ГДЕ
	|	НЕ УведомленияПродукта.Прочитано";
	
КонецФункции

Функция ТекстЗапросаПоказаУведомленийПользователя() Экспорт
	
	Возврат ТекстЗапросаУведомленийПользователя() +
	"ВЫБРАТЬ
	|	УведомленияПродукта.Уведомление КАК Уведомление,
	|	УведомленияПродукта.Уведомление.Наименование КАК Заголовок,
	|	УведомленияПродукта.Уведомление.ДатаНачала КАК ДатаНачала,
	|	УведомленияПродукта.Уведомление.ДатаОкончания КАК ДатаОкончания,
	|	УведомленияПродукта.Уведомление.Текст КАК Текст,
	|	ЕСТЬNULL(УведомленияПродукта.Прочитано, ЛОЖЬ) КАК Прочитано,
	|	ВЫБОР
	|		КОГДА УведомленияПродукта.Уведомление.Приоритет = ""high""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Важное,
	|	УведомленияПродукта.Уведомление.Идентификатор КАК Идентификатор,
	|	УведомленияПродукта.Уведомление.ТипКонтента КАК ТипКонтента
	|ИЗ
	|	УведомленияПродукта КАК УведомленияПродукта";
	
КонецФункции

Процедура ПоставитьСообщениеВОчередьНаОтправкуВТелеграм(ТелефоныДляОтправки, Уведомление)
	
	ТекстЗаголовка = "<b>" + Уведомление.Наименование + "</b>
		|
		|Получение новостных сообщений можно отключить в модуле 1С Контур.Логистика в основных настройках ""Контакты администратора"".";
	
	Если Найти(Уведомление.Текст, "<html") = 0 Тогда
		ТекстСообщения = ОбернутьТекстУведомленияВHTML(Уведомление.Текст);
	Иначе
		ТекстСообщения = Уведомление.Текст;
	КонецЕсли;
	
	ПотокДанных = Новый ПотокВПамяти();
	ЗаписьТекста = Новый ЗаписьТекста(ПотокДанных);
	ЗаписьТекста.Записать(ТекстСообщения);
	ЗаписьТекста.Закрыть();
	
	ДвоичныеДанные = ПотокДанных.ЗакрытьИПолучитьДвоичныеДанные();
	
	НовоеСообщение = КонтурЛогистика_РаботаСТелеграм.МанифестСообщения();
	НовоеСообщение.Тип = "document";
	НовоеСообщение.Заголовок = ТекстЗаголовка;
	НовоеСообщение.ИмяФайла = "Подробнее.html";
	НовоеСообщение.Данные = ДвоичныеДанные;
	
	Сообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовоеСообщение);
	
	Для Каждого Телефон Из ТелефоныДляОтправки Цикл
		РегистрыСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДобавитьВОчередь(Телефон, Сообщения);
	КонецЦикла;
	
	РегистрыСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ОтправитьСообщения(ТелефоныДляОтправки);
	
КонецПроцедуры

Процедура ОтправитьСообщениеНаАдресЭлектроннойПочты(АдресЭлектроннойПочты, Уведомление)
	
	ТекстЗаголовка = Уведомление.Наименование;
	
	Если Найти(Уведомление.Текст, "<html") = 0 Тогда
		ТекстСообщения = ОбернутьТекстУведомленияВHTML(Уведомление.Текст);
	Иначе
		ТекстСообщения = Уведомление.Текст;
	КонецЕсли;
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = ТекстЗаголовка;
	Письмо.Тексты.Добавить(ТекстСообщения, ТипТекстаПочтовогоСообщения.HTML);
	
	Для Каждого Получатель Из АдресЭлектроннойПочты Цикл
		Письмо.Получатели.Добавить(Получатель);
	КонецЦикла;
	
	Попытка
		КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
	Исключение
		
		ТекстОшибкиОтправкиПочты = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации("КонтурЛогистика_ОбновлениеСервер_ОтправитьСообщениеНаАдресЭлектроннойПочты",
			УровеньЖурналаРегистрации.Ошибка,, Уведомление, ТекстОшибкиОтправкиПочты);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
